#заполнение массива рандомными числами
from random import randint
N = 10
arr = []
for i in range(N):
    arr.append(randint(1,99))
print(arr)

#i - индекс ячейки, в которую записывается минимальный элемент
i = 0

#m - индекс ячейки с минимальным значением
while i < N - 1:
    m = i
    #Поиск начинается с ячейки следующей за i
    j = i + 1
    while j < N:
        if arr[j] < arr[m]:
            m = j
        j += 1

    #В ячейку i записывается найденный минимум, знаечние i переносится на старое место минимума
    arr[i], arr[m] = arr[m], arr[i]
    i+=1

print(arr)